sorosaulong-ux/gd32-test-project/Start/startup_gd32a714x.s
                DCD     TIMER5_CH2_UP_IRQHandler          ; 232:TIMER5 channel 2 upate interrupt
                DCD     TIMER5_CH3_UP_IRQHandler          ; 233:TIMER5 channel 3 upate interrupt
                DCD     TIMER6_CH0_UP_IRQHandler          ; 234:TIMER6 channel 0 upate interrupt
                DCD     TIMER6_CH1_UP_IRQHandler          ; 235:TIMER6 channel 1 upate interrupt
                DCD     TIMER6_CH2_UP_IRQHandler          ; 236:TIMER6 channel 2 upate interrupt
                DCD     TIMER6_CH3_UP_IRQHandler          ; 237:TIMER6 channel 3 upate interrupt
                DCD     0                                 ; 238:Reserved
                DCD     0                                 ; 239:Reserved
                DCD     0                                 ; 240:Reserved
                DCD     0                                 ; 241:Reserved
                DCD     0                                 ; 242:Reserved
                DCD     0                                 ; 243:Reserved
                DCD     0                                 ; 244:Reserved
                DCD     0                                 ; 245:Reserved
                DCD     0                                 ; 246:Reserved
                DCD     0                                 ; 247:Reserved
                DCD     0                                 ; 248:Reserved
                DCD     0                                 ; 249:Reserved
                DCD     0                                 ; 250:Reserved
                DCD     0                                 ; 251:Reserved
                DCD     0                                 ; 252:Reserved
                DCD     0                                 ; 253:Reserved
                DCD     CAN6_ECCERR_IRQHandler            ; 254:CAN6 ECC error interrupt
                DCD     CAN7_ECCERR_IRQHandler            ; 255:CAN7 ECC error interrupt
__Vectors_End

__Vectors_Size  EQU     __Vectors_End - __Vectors

                AREA    |.text|, CODE, READONLY

;/* reset Handler */
Reset_Handler   PROC
                EXPORT  Reset_Handler                     [WEAK]
                IMPORT  |Image$$RW_IRAM1$$RW$$Base|

;If the actual size of SRAM used exceeds 32K, users need to modify the size to be greater than or equal to the actual size in use.
                 LDR     R0, =|Image$$RW_IRAM1$$RW$$Base|
                 ADD     R1, R0, #0x8000      ;Default SRAM size 32K
                 LDR     R2, =0x0
SRAM_INIT        STRD    R2, R2, [ R0 ] , #8
                 CMP     R0, R1
                 BNE     SRAM_INIT

;If the actual size of ITCMSRAM used exceeds 32K, users need to modify the size to be greater than or equal to the actual size in use.
                 LDR     R0, =0x00000000
                 ADD     R1, R0, #0x8000     ;Default ITCMSRAM size 32K
                 LDR     R2, =0x0
ITCMSRAM_INIT    STRD    R2, R2, [ R0 ] , #8
                 CMP     R0, R1
                 BNE     ITCMSRAM_INIT

;If the actual size of DTCMSRAM used exceeds 32K, users need to modify the size to be greater than or equal to the actual size in use.
                 LDR     R0, =0x20000000
                 ADD     R1, R0, #0x8000     ;Default DTCMSRAM size 32K
                 LDR     R2, =0x0
DTCMSRAM_INIT    STRD    R2, R2, [ R0 ] , #8
                 CMP     R0, R1
                 BNE     DTCMSRAM_INIT

                 IMPORT  SystemInit
                 IMPORT  __main
                 LDR     R0, =SystemInit
                 BLX     R0
                 LDR     R0, =__main
                 BX      R0
                 ENDP

;/* dummy Exception Handlers */
NMI_Handler     PROC
                EXPORT  NMI_Handler                       [WEAK]
                B       .
                ENDP
HardFault_Handler\
                PROC
                EXPORT  HardFault_Handler                 [WEAK]
                B       .
                ENDP
MemManage_Handler\
                PROC
                EXPORT  MemManage_Handler                 [WEAK]
                B       .
                ENDP
BusFault_Handler\
                PROC
                EXPORT  BusFault_Handler                  [WEAK]
                B       .
                ENDP
UsageFault_Handler\
                PROC
                EXPORT  UsageFault_Handler                [WEAK]
                B       .
                ENDP
SVC_Handler     PROC
                EXPORT  SVC_Handler                       [WEAK]
                B       .
                ENDP
DebugMon_Handler\
                PROC
                EXPORT  DebugMon_Handler                  [WEAK]
                B       .
                ENDP
PendSV_Handler\
                PROC
                EXPORT  PendSV_Handler                    [WEAK]
                B       .
                ENDP
SysTick_Handler\
                PROC
                EXPORT  SysTick_Handler                   [WEAK]
                B       .
                ENDP

Default_Handler PROC
;               /* external interrupts handler */
                EXPORT  WWDGT0_IRQHandler                   [WEAK]
                EXPORT  HVD_LVD_IRQHandler                  [WEAK]
                EXPORT  RTC_Alarm_IRQHandler                [WEAK]
                EXPORT  RTC_IRQHandler                      [WEAK]
                EXPORT  FMC_IRQHandler                      [WEAK]
                EXPORT  RCU_IRQHandler                      [WEAK]
                EXPORT  EXTI0_IRQHandler                    [WEAK]
                EXPORT  EXTI1_IRQHandler                    [WEAK]
                EXPORT  EXTI2_IRQHandler                    [WEAK]
                EXPORT  EXTI3_IRQHandler                    [WEAK]
                EXPORT  EXTI4_IRQHandler                    [WEAK]
                EXPORT  DMA0_Channel0_IRQHandler            [WEAK]
                EXPORT  DMA0_Channel1_IRQHandler            [WEAK]
                EXPORT  DMA0_Channel2_IRQHandler            [WEAK]
                EXPORT  DMA0_Channel3_IRQHandler            [WEAK]
                EXPORT  DMA0_Channel4_IRQHandler            [WEAK]
                EXPORT  DMA0_Channel5_IRQHandler            [WEAK]
                EXPORT  DMA0_Channel6_IRQHandler            [WEAK]
                EXPORT  ADC0_IRQHandler                     [WEAK]
                EXPORT  CAN0_Message_IRQHandler             [WEAK]
                EXPORT  CAN0_IRQHandler                     [WEAK]
                EXPORT  CPU_INT0_IRQHandler                 [WEAK]
                EXPORT  CPU_INT1_IRQHandler                 [WEAK]
                EXPORT  CPU_INT2_IRQHandler                 [WEAK]
                EXPORT  CPU_INT3_IRQHandler                 [WEAK]
                EXPORT  CAN0_WKUP_IRQHandler                [WEAK]
                EXPORT  TIMER0_BRK_UP_TRG_CMT_IRQHandler    [WEAK]
                EXPORT  TIMER2_IRQHandler                   [WEAK]
                EXPORT  TIMER1_IRQHandler                   [WEAK]
                EXPORT  TIMER19_BRK_UP_TRG_CMT_IRQHandler   [WEAK]
                EXPORT  JDC_IRQHandler                      [WEAK]
                EXPORT  I2C0_EV_IRQHandler                  [WEAK]
                EXPORT  I2C0_ER_IRQHandler                  [WEAK]
                EXPORT  I2C1_EV_IRQHandler                  [WEAK]
                EXPORT  I2C1_ER_IRQHandler                  [WEAK]
                EXPORT  SPI0_IRQHandler                     [WEAK]
                EXPORT  SPI1_IRQHandler                     [WEAK]
                EXPORT  USART0_IRQHandler                   [WEAK]
                EXPORT  USART1_IRQHandler                   [WEAK]
                EXPORT  USART2_IRQHandler                   [WEAK]
                EXPORT  EXTI10_15_IRQHandler                [WEAK]
                EXPORT  EXTI5_9_IRQHandler                  [WEAK]
                EXPORT  TAMPER_IRQHandler                   [WEAK]
                EXPORT  TIMER20_BRK_UP_TRG_CMT_IRQHandler   [WEAK]
                EXPORT  EXTI42_101_IRQHandler               [WEAK]
                EXPORT  TIMER7_BRK_UP_TRG_CMT_IRQHandler    [WEAK]
                EXPORT  PLL_LOL_DES_RESET_IRQHandler        [WEAK]
                EXPORT  DMAMUX_OVR_IRQHandler               [WEAK]
                EXPORT  FPU_WAB_IRQHandler                  [WEAK]
                EXPORT  CMP0_EXTI_IRQHandler                [WEAK]
                EXPORT  CMP1_EXTI_IRQHandler                [WEAK]
                EXPORT  FMU_INIT_IRQHandler                 [WEAK]
                EXPORT  ADC1_IRQHandler                     [WEAK]
                EXPORT  ADC2_IRQHandler                     [WEAK]
                EXPORT  DAC0_IRQHandler                     [WEAK]
                EXPORT  STCM_IRQHandler                     [WEAK]
                EXPORT  DMA1_Channel0_IRQHandler            [WEAK]
                EXPORT  DMA1_Channel1_IRQHandler            [WEAK]
                EXPORT  DMA1_Channel2_IRQHandler            [WEAK]
                EXPORT  DMA1_Channel3_IRQHandler            [WEAK]
                EXPORT  DMA1_Channel4_IRQHandler            [WEAK]
                EXPORT  WWDGT1_IRQHandler                   [WEAK]
                EXPORT  CAN1_WKUP_IRQHandler                [WEAK]
                EXPORT  CAN1_Message_IRQHandler             [WEAK]
                EXPORT  CAN1_IRQHandler                     [WEAK]
                EXPORT  CTI0_IRQHandler                     [WEAK]
                EXPORT  CTI1_IRQHandler                     [WEAK]
                EXPORT  CAN0_ECCERR_IRQHandler              [WEAK]
                EXPORT  CAN1_ECCERR_IRQHandler              [WEAK]
                EXPORT  CAN2_ECCERR_IRQHandler              [WEAK]
                EXPORT  MFCOM_IRQHandler                    [WEAK]
                EXPORT  CMP0_IRQHandler                     [WEAK]
                EXPORT  CMP1_IRQHandler                     [WEAK]
                EXPORT  SENT_IRQHandler                     [WEAK]
                EXPORT  HWSEM_IRQHandler                    [WEAK]
                EXPORT  CAN3_ECCERR_IRQHandler              [WEAK]
                EXPORT  CAN4_ECCERR_IRQHandler              [WEAK]
                EXPORT  DAC1_IRQHandler                     [WEAK]
                EXPORT  HSM_COM0_IRQHandler                 [WEAK]
                EXPORT  HSM_COM1_IRQHandler                 [WEAK]
                EXPORT  FMU_CAT_IRQHandler                  [WEAK]
                EXPORT  RCTL_IRQHandler                     [WEAK]
                EXPORT  IOC_IRQHandler                      [WEAK]
                EXPORT  SPI2_IRQHandler                     [WEAK]
                EXPORT  SPI3_IRQHandler                     [WEAK]
                EXPORT  SPI4_IRQHandler                     [WEAK]
                EXPORT  SPI5_IRQHandler                     [WEAK]
                EXPORT  SPI6_IRQHandler                     [WEAK]
                EXPORT  SPI7_IRQHandler                     [WEAK]
                EXPORT  QSPI_IRQHandler                     [WEAK]
                EXPORT  USART3_IRQHandler                   [WEAK]
                EXPORT  USART4_IRQHandler                   [WEAK]
                EXPORT  USART5_IRQHandler                   [WEAK]
                EXPORT  CAN2_WKUP_IRQHandler                [WEAK]
                EXPORT  CAN3_WKUP_IRQHandler                [WEAK]
                EXPORT  CAN4_WKUP_IRQHandler                [WEAK]
                EXPORT  CAN5_WKUP_IRQHandler                [WEAK]
                EXPORT  CAN6_WKUP_IRQHandler                [WEAK]
                EXPORT  CAN7_WKUP_IRQHandler                [WEAK]
                EXPORT  CAN2_Message_IRQHandler             [WEAK]
                EXPORT  CAN2_IRQHandler                     [WEAK]
                EXPORT  CAN3_Message_IRQHandler             [WEAK]
                EXPORT  CAN3_IRQHandler                     [WEAK]
                EXPORT  CAN4_Message_IRQHandler             [WEAK]
                EXPORT  CAN4_IRQHandler                     [WEAK]
                EXPORT  CAN5_Message_IRQHandler             [WEAK]
                EXPORT  CAN5_IRQHandler                     [WEAK]
                EXPORT  CAN6_Message_IRQHandler             [WEAK]
                EXPORT  CAN6_IRQHandler                     [WEAK]
                EXPORT  CAN7_Message_IRQHandler             [WEAK]
                EXPORT  CAN7_IRQHandler                     [WEAK]
                EXPORT  TIMER19_CC0_CC0N_IRQHandler         [WEAK]
                EXPORT  TIMER19_CC1_CC1N_IRQHandler         [WEAK]
                EXPORT  TIMER19_CC2_CC2N_IRQHandler         [WEAK]
                EXPORT  TIMER19_CC3_CC3N_IRQHandler         [WEAK]
                EXPORT  TIMER20_CC0_CC0N_IRQHandler         [WEAK]
                EXPORT  TIMER20_CC1_CC1N_IRQHandler         [WEAK]
                EXPORT  TIMER20_CC2_CC2N_IRQHandler         [WEAK]
                EXPORT  TIMER20_CC3_CC3N_IRQHandler         [WEAK]
                EXPORT  TIMER60_CC0_CC0N_IRQHandler         [WEAK]
                EXPORT  TIMER60_CC1_CC1N_IRQHandler         [WEAK]
                EXPORT  TIMER60_CC2_CC2N_IRQHandler         [WEAK]
                EXPORT  TIMER60_CC3_CC3N_IRQHandler         [WEAK]
                EXPORT  TIMER61_CC0_CC0N_IRQHandler         [WEAK]
                EXPORT  TIMER61_CC1_CC1N_IRQHandler         [WEAK]
                EXPORT  TIMER61_CC2_CC2N_IRQHandler         [WEAK]
                EXPORT  TIMER61_CC3_CC3N_IRQHandler         [WEAK]
                EXPORT  TIMER62_CC0_CC0N_IRQHandler         [WEAK]
                EXPORT  TIMER62_CC1_CC1N_IRQHandler         [WEAK]
                EXPORT  TIMER62_CC2_CC2N_IRQHandler         [WEAK]
                EXPORT  TIMER62_CC3_CC3N_IRQHandler         [WEAK]
                EXPORT  TIMER63_CC0_CC0N_IRQHandler         [WEAK]
                EXPORT  TIMER63_CC1_CC1N_IRQHandler         [WEAK]
                EXPORT  TIMER63_CC2_CC2N_IRQHandler         [WEAK]
                EXPORT  TIMER63_CC3_CC3N_IRQHandler         [WEAK]
                EXPORT  DMA0_Channel7_IRQHandler            [WEAK]
                EXPORT  DMA0_Channel8_IRQHandler            [WEAK]
                EXPORT  DMA0_Channel9_IRQHandler            [WEAK]
                EXPORT  DMA0_Channel10_IRQHandler           [WEAK]
                EXPORT  DMA0_Channel11_IRQHandler           [WEAK]
                EXPORT  DMA0_Channel12_IRQHandler           [WEAK]
                EXPORT  DMA0_Channel13_IRQHandler           [WEAK]
                EXPORT  DMA0_Channel14_IRQHandler           [WEAK]
                EXPORT  DMA0_Channel15_IRQHandler           [WEAK]
                EXPORT  DMA1_Channel5_IRQHandler            [WEAK]
                EXPORT  DMA1_Channel6_IRQHandler            [WEAK]
                EXPORT  DMA1_Channel7_IRQHandler            [WEAK]
                EXPORT  DMA1_Channel8_IRQHandler            [WEAK]
                EXPORT  DMA1_Channel9_IRQHandler            [WEAK]
                EXPORT  DMA1_Channel10_IRQHandler           [WEAK]
                EXPORT  DMA1_Channel11_IRQHandler           [WEAK]
                EXPORT  DMA1_Channel12_IRQHandler           [WEAK]
                EXPORT  DMA1_Channel13_IRQHandler           [WEAK]
                EXPORT  DMA1_Channel14_IRQHandler           [WEAK]
                EXPORT  DMA1_Channel15_IRQHandler           [WEAK]
                EXPORT  MCMUA_RX_IRQHandler                 [WEAK]
                EXPORT  MCMUA_TX_IRQHandler                 [WEAK]
                EXPORT  MCMUA_NORMAL_IRQHandler             [WEAK]
                EXPORT  MCMUB_RX_IRQHandler                 [WEAK]
                EXPORT  MCMUB_TX_IRQHandler                 [WEAK]
                EXPORT  MCMUB_NORMAL_IRQHandler             [WEAK]
                EXPORT  LIN0_IRQHandler                     [WEAK]
                EXPORT  LIN1_IRQHandler                     [WEAK]
                EXPORT  LIN2_IRQHandler                     [WEAK]
                EXPORT  LIN3_IRQHandler                     [WEAK]
                EXPORT  LIN4_IRQHandler                     [WEAK]
                EXPORT  LIN5_IRQHandler                     [WEAK]
                EXPORT  LIN6_IRQHandler                     [WEAK]
                EXPORT  LIN7_IRQHandler                     [WEAK]
                EXPORT  LIN8_IRQHandler                     [WEAK]
                EXPORT  LIN9_IRQHandler                     [WEAK]
                EXPORT  LIN10_IRQHandler                    [WEAK]
                EXPORT  LIN11_IRQHandler                    [WEAK]
                EXPORT  TIMER0_CC0_CC0N_IRQHandler          [WEAK]
                EXPORT  TIMER0_CC1_CC1N_IRQHandler          [WEAK]
                EXPORT  TIMER0_CC2_CC2N_IRQHandler          [WEAK]
                EXPORT  TIMER0_CC3_CC3N_IRQHandler          [WEAK]
                EXPORT  TIMER7_CC0_CC0N_IRQHandler          [WEAK]
                EXPORT  TIMER7_CC1_CC1N_IRQHandler          [WEAK]
                EXPORT  TIMER7_CC2_CC2N_IRQHandler          [WEAK]
                EXPORT  TIMER7_CC3_CC3N_IRQHandler          [WEAK]
                EXPORT  TIMER1_CC0_IRQHandler               [WEAK]
                EXPORT  TIMER1_CC1_IRQHandler               [WEAK]
                EXPORT  TIMER1_CC2_IRQHandler               [WEAK]
                EXPORT  TIMER1_CC3_IRQHandler               [WEAK]
                EXPORT  TIMER2_CC0_IRQHandler               [WEAK]
                EXPORT  TIMER2_CC1_IRQHandler               [WEAK]
                EXPORT  TIMER2_CC2_IRQHandler               [WEAK]
                EXPORT  TIMER2_CC3_IRQHandler               [WEAK]
                EXPORT  FWDGT_IRQHandler                    [WEAK]
                EXPORT  ETH_IRQHandler                      [WEAK]
                EXPORT  ETH_WKUP_IRQHandler                 [WEAK]
                EXPORT  ETH_TX_IRQHandler                   [WEAK]
                EXPORT  ETH_RX_IRQHandler                   [WEAK]
                EXPORT  ETH_SAFETY_IRQHandler               [WEAK]
                EXPORT  RCU_CK_FAIL_IRQHandler              [WEAK]
                EXPORT  CAN5_ECCERR_IRQHandler              [WEAK]
                EXPORT  TIMER60_BRK_UP_TRG_CMT_IRQHandler   [WEAK]
                EXPORT  TIMER61_BRK_UP_TRG_CMT_IRQHandler   [WEAK]
                EXPORT  TIMER62_BRK_UP_TRG_CMT_IRQHandler   [WEAK]
                EXPORT  TIMER63_BRK_UP_TRG_CMT_IRQHandler   [WEAK]
                EXPORT  TIMER5_CH0_UP_IRQHandler            [WEAK]
                EXPORT  TIMER5_CH1_UP_IRQHandler            [WEAK]
                EXPORT  TIMER5_CH2_UP_IRQHandler            [WEAK]
                EXPORT  TIMER5_CH3_UP_IRQHandler            [WEAK]
                EXPORT  TIMER6_CH0_UP_IRQHandler            [WEAK]
                EXPORT  TIMER6_CH1_UP_IRQHandler            [WEAK]
                EXPORT  TIMER6_CH2_UP_IRQHandler            [WEAK]
                EXPORT  TIMER6_CH3_UP_IRQHandler            [WEAK]
                EXPORT  CAN6_ECCERR_IRQHandler              [WEAK]
                EXPORT  CAN7_ECCERR_IRQHandler              [WEAK]

;/* external interrupts handler */
WWDGT0_IRQHandler
HVD_LVD_IRQHandler
RTC_Alarm_IRQHandler
RTC_IRQHandler
FMC_IRQHandler
RCU_IRQHandler
EXTI0_IRQHandler
EXTI1_IRQHandler
EXTI2_IRQHandler
EXTI3_IRQHandler
EXTI4_IRQHandler
DMA0_Channel0_IRQHandler
DMA0_Channel1_IRQHandler
DMA0_Channel2_IRQHandler
DMA0_Channel3_IRQHandler
DMA0_Channel4_IRQHandler
DMA0_Channel5_IRQHandler
DMA0_Channel6_IRQHandler
ADC0_IRQHandler
CAN0_Message_IRQHandler
CAN0_IRQHandler
CPU_INT0_IRQHandler
CPU_INT1_IRQHandler
CPU_INT2_IRQHandler
CPU_INT3_IRQHandler
CAN0_WKUP_IRQHandler
TIMER0_BRK_UP_TRG_CMT_IRQHandler
TIMER2_IRQHandler
TIMER1_IRQHandler
TIMER19_BRK_UP_TRG_CMT_IRQHandler
JDC_IRQHandler
I2C0_EV_IRQHandler
I2C0_ER_IRQHandler
I2C1_EV_IRQHandler
I2C1_ER_IRQHandler
SPI0_IRQHandler
SPI1_IRQHandler
USART0_IRQHandler
USART1_IRQHandler
USART2_IRQHandler
EXTI10_15_IRQHandler
EXTI5_9_IRQHandler
TAMPER_IRQHandler
TIMER20_BRK_UP_TRG_CMT_IRQHandler 
EXTI42_101_IRQHandler
TIMER7_BRK_UP_TRG_CMT_IRQHandler
PLL_LOL_DES_RESET_IRQHandler
DMAMUX_OVR_IRQHandler
FPU_WAB_IRQHandler
CMP0_EXTI_IRQHandler
CMP1_EXTI_IRQHandler
FMU_INIT_IRQHandler
ADC1_IRQHandler
ADC2_IRQHandler
DAC0_IRQHandler
STCM_IRQHandler
DMA1_Channel0_IRQHandler
DMA1_Channel1_IRQHandler
DMA1_Channel2_IRQHandler
DMA1_Channel3_IRQHandler
DMA1_Channel4_IRQHandler
WWDGT1_IRQHandler
CAN1_WKUP_IRQHandler
CAN1_Message_IRQHandler
CAN1_IRQHandler
CTI0_IRQHandler
CTI1_IRQHandler
CAN0_ECCERR_IRQHandler
CAN1_ECCERR_IRQHandler
CAN2_ECCERR_IRQHandler
MFCOM_IRQHandler
CMP0_IRQHandler
CMP1_IRQHandler
SENT_IRQHandler
HWSEM_IRQHandler
CAN3_ECCERR_IRQHandler
CAN4_ECCERR_IRQHandler
DAC1_IRQHandler
HSM_COM0_IRQHandler
HSM_COM1_IRQHandler
FMU_CAT_IRQHandler
RCTL_IRQHandler
IOC_IRQHandler
SPI2_IRQHandler
SPI3_IRQHandler
SPI4_IRQHandler
SPI5_IRQHandler
SPI6_IRQHandler
SPI7_IRQHandler
QSPI_IRQHandler
USART3_IRQHandler
USART4_IRQHandler
USART5_IRQHandler
CAN2_WKUP_IRQHandler
CAN3_WKUP_IRQHandler
CAN4_WKUP_IRQHandler
CAN5_WKUP_IRQHandler
CAN6_WKUP_IRQHandler
CAN7_WKUP_IRQHandler
CAN2_Message_IRQHandler
CAN2_IRQHandler
CAN3_Message_IRQHandler
CAN3_IRQHandler
CAN4_Message_IRQHandler
CAN4_IRQHandler
CAN5_Message_IRQHandler
CAN5_IRQHandler
CAN6_Message_IRQHandler
CAN6_IRQHandler
CAN7_Message_IRQHandler
CAN7_IRQHandler
TIMER19_CC0_CC0N_IRQHandler
TIMER19_CC1_CC1N_IRQHandler
TIMER19_CC2_CC2N_IRQHandler
TIMER19_CC3_CC3N_IRQHandler
TIMER20_CC0_CC0N_IRQHandler
TIMER20_CC1_CC1N_IRQHandler
TIMER20_CC2_CC2N_IRQHandler
TIMER20_CC3_CC3N_IRQHandler
TIMER60_CC0_CC0N_IRQHandler
TIMER60_CC1_CC1N_IRQHandler
TIMER60_CC2_CC2N_IRQHandler
TIMER60_CC3_CC3N_IRQHandler
TIMER61_CC0_CC0N_IRQHandler
TIMER61_CC1_CC1N_IRQHandler
TIMER61_CC2_CC2N_IRQHandler
TIMER61_CC3_CC3N_IRQHandler
TIMER62_CC0_CC0N_IRQHandler
TIMER62_CC1_CC1N_IRQHandler
TIMER62_CC2_CC2N_IRQHandler
TIMER62_CC3_CC3N_IRQHandler
TIMER63_CC0_CC0N_IRQHandler
TIMER63_CC1_CC1N_IRQHandler
TIMER63_CC2_CC2N_IRQHandler
TIMER63_CC3_CC3N_IRQHandler
DMA0_Channel7_IRQHandler
DMA0_Channel8_IRQHandler
DMA0_Channel9_IRQHandler
DMA0_Channel10_IRQHandler
DMA0_Channel11_IRQHandler
DMA0_Channel12_IRQHandler
DMA0_Channel13_IRQHandler
DMA0_Channel14_IRQHandler
DMA0_Channel15_IRQHandler
DMA1_Channel5_IRQHandler
DMA1_Channel6_IRQHandler
DMA1_Channel7_IRQHandler
DMA1_Channel8_IRQHandler
DMA1_Channel9_IRQHandler
DMA1_Channel10_IRQHandler
DMA1_Channel11_IRQHandler
DMA1_Channel12_IRQHandler
DMA1_Channel13_IRQHandler
DMA1_Channel14_IRQHandler
DMA1_Channel15_IRQHandler
MCMUA_RX_IRQHandler
MCMUA_TX_IRQHandler
MCMUA_NORMAL_IRQHandler
MCMUB_RX_IRQHandler
MCMUB_TX_IRQHandler
MCMUB_NORMAL_IRQHandler
LIN0_IRQHandler
LIN1_IRQHandler
LIN2_IRQHandler
LIN3_IRQHandler
LIN4_IRQHandler
LIN5_IRQHandler
LIN6_IRQHandler
LIN7_IRQHandler
LIN8_IRQHandler
LIN9_IRQHandler
LIN10_IRQHandler
LIN11_IRQHandler
TIMER0_CC0_CC0N_IRQHandler
TIMER0_CC1_CC1N_IRQHandler
TIMER0_CC2_CC2N_IRQHandler
TIMER0_CC3_CC3N_IRQHandler
TIMER7_CC0_CC0N_IRQHandler
TIMER7_CC1_CC1N_IRQHandler
TIMER7_CC2_CC2N_IRQHandler
TIMER7_CC3_CC3N_IRQHandler
TIMER1_CC0_IRQHandler
TIMER1_CC1_IRQHandler
TIMER1_CC2_IRQHandler
TIMER1_CC3_IRQHandler
TIMER2_CC0_IRQHandler
TIMER2_CC1_IRQHandler
TIMER2_CC2_IRQHandler
TIMER2_CC3_IRQHandler
FWDGT_IRQHandler
ETH_IRQHandler
ETH_WKUP_IRQHandler
ETH_TX_IRQHandler
ETH_RX_IRQHandler
ETH_SAFETY_IRQHandler
RCU_CK_FAIL_IRQHandler
CAN5_ECCERR_IRQHandler
TIMER60_BRK_UP_TRG_CMT_IRQHandler
TIMER61_BRK_UP_TRG_CMT_IRQHandler
TIMER62_BRK_UP_TRG_CMT_IRQHandler
TIMER63_BRK_UP_TRG_CMT_IRQHandler
TIMER5_CH0_UP_IRQHandler
TIMER5_CH1_UP_IRQHandler
TIMER5_CH2_UP_IRQHandler
TIMER5_CH3_UP_IRQHandler
TIMER6_CH0_UP_IRQHandler
TIMER6_CH1_UP_IRQHandler
TIMER6_CH2_UP_IRQHandler
TIMER6_CH3_UP_IRQHandler
CAN6_ECCERR_IRQHandler
CAN7_ECCERR_IRQHandler
                B       .
                ENDP

                ALIGN

; user Initial Stack & Heap

                IF      :DEF:__MICROLIB

                EXPORT  __initial_sp
                EXPORT  __heap_base
                EXPORT  __heap_limit

                ELSE

                IMPORT  __use_two_region_memory
                EXPORT  __user_initial_stackheap

__user_initial_stackheap PROC
                LDR     R0, =  Heap_Mem
                LDR     R1, =(Stack_Mem + Stack_Size)
                LDR     R2, = (Heap_Mem +  Heap_Size)
                LDR     R3, = Stack_Mem
                BX      LR
                ENDP

                ALIGN

                ENDIF

                END

